Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Tofu plans
<details><summary>Infinisil-s-Test-Organization</summary>

```

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

OpenTofu will perform the following actions:

  # github_issue_label.this["codeowners-samples:bug"] will be destroyed
  # (because key ["codeowners-samples:bug"] is not in for_each map)
  - resource "github_issue_label" "this" {
      - color       = "d73a4a" -> null
      - description = "Something isn't working" -> null
      - etag        = "W/\"40813de2a44c0a7d830827b4ab4ff3764cb282251967619d603dbfcfef42ae50\"" -> null
      - id          = "codeowners-samples:bug" -> null
      - name        = "bug" -> null
      - repository  = "codeowners-samples" -> null
      - url         = "https://api.github.com/repos/Infinisil-s-Test-Organization/codeowners-samples/labels/bug" -> null
    }

  # github_issue_label.this["codeowners-samples:bugs-arent-real"] will be created
  + resource "github_issue_label" "this" {
      + color       = "d73a4a"
      + description = "Something isn't working"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bugs-arent-real"
      + repository  = "codeowners-samples"
      + url         = (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>
<!-- Sticky Pull Request Commentplan -->